
// Создайте класс Card, который создаёт карточку с текстом и ссылкой на изображение:
// 1. принимает в конструктор её данные и селектор её template-элемента;
// 2. содержит приватные методы, которые работают с разметкой, устанавливают слушателей событий;
// 3. содержит приватные методы для каждого обработчика;
// 4. содержит один публичный метод, который возвращает полностью работоспособный и
//    наполненный данными элемент карточки.
// Для каждой карточки создайте экземпляр класса Card.





class Card {

constructor(data, templateSelector) {

}

_createCardElement() {}

_setEventListeners() {

}

getCard() {

}

}
